
-- 1. Запрос данных о товарах с определенными условиями
SELECT * FROM Товары
WHERE (Код_наименования IN (1, 3) AND Марка SIMILAR TO 'A%M%S%')
   OR (Страна_производитель = 'Япония' AND EXTRACT(MONTH FROM Дата_производства) = 1 AND EXTRACT(YEAR FROM Дата_производства) = 2020)
   OR (Цена BETWEEN 20000 AND 35000 AND Категория IN (1, 2));

-- 2. Запросы с массивом цен
SELECT * FROM Товары WHERE Цена > ANY(ARRAY[20000, 35000, 50000]);
SELECT * FROM Товары WHERE Цена > ALL(ARRAY[10000, 20000, 30000, 40000]);

-- 3. Запрос с использованием регулярного выражения
SELECT * FROM Товары WHERE Марка SIMILAR TO '%(s1|s2)%';

-- 4. Запрос на перекрытие диапазона дат
SELECT * FROM Товары 
WHERE Дата_производства <= '2022-05-18' AND Дата_поставки >= '2022-01-15';

-- 5. Запрос на соответствие условиям даты и названия
SELECT * FROM Товары
WHERE EXTRACT(YEAR FROM Дата_производства) % 10 = 0 AND SUBSTRING(Марка FROM 2 FOR 1) = 'u';
