{"1":{"Наименование маршрута ":"Познавательные каникулы: едем с детьми в Тульскую область","Место проведения":"Тульская область","Сезонность":"Круглогодично","Продолжительность":"3 дня","Описание маршрута ":"Оружие, самовары и пряники — это, конечно же, Тула. Здесь вам дадут испечь (и тут же съесть) пряник. Это идеальный вариант для отдыха с детьми.\n\nРекомендуем добраться до Казанской набережной вдоль старого русла Упы  пообедать в одном из ресторанов. Далее — Тульский кремль. На улице Металлистов помимо кафе найдете ремесленные лавки: можно не откладывать на потом покупку сувениров. Их продают также в Центре приема гостей Тульской области.\n\nИ не забудьте запланировать поход в музей оружия, где хранится показательная коллекция боевого снаряжения и можно пострелять в интерактивном тире из копий реального оружия.\n\nВсе это и многое другое — в 2 часах езды (поезд, автобус или автомобиль) от Москвы (182 км)."},"2":{"Наименование маршрута ":"Самобытные усадьбы Тульской области","Место проведения":"Тульская область","Сезонность":"Круглогодично","Продолжительность":"1 день","Описание маршрута ":"Городская или помещичья, дворянская или крестьянская, каждая усадьба была небольшим мирком: в нем были жилые постройки, хозяйственные, и, как правило, усадебный парк или хотя бы небольшой садик, если речь идет о городе. В крупных усадьбах строили и собственную церковь. Русская усадьба, наверное, известна нам ярче, чем какие-либо еще явления дореволюционной жизни — многократно описана в литературе, запечатлена на холстах, отражена в мемуарах. Ее называют «социокультурным феноменом». Достаточно вспомнить признание Льва Толстого: «Без своей Ясной Поляны я трудно могу представить себе Россию и мое отношение к ней. Без Ясной Поляны я, может быть, яснее увижу общие законы, необходимые для моего отечества, но я не буду до пристрастия любить его».\n\n"},"3":{"Наименование маршрута ":"Пряничные выходные: едем с семьей в Тулу","Место проведения":"Тульская область","Сезонность":"Круглогодично","Продолжительность":"1 день","Описание маршрута ":"У вас есть пара дней, чтобы отдохнуть всей семьей? Смело приезжайте в Тулу. Для самых маленьких путешественников и их родителей в областном центре и его окрестностях открыты двери музеев, парков, заповедников и других увлекательных заведений.\n\nВ путешествии по этому маршруту вы попробуете чай из настоящего самовара, приготовите и продегустируете тульский пряник, переместитесь в прошлое, посетив старинный действующий железнодорожный вокзал, познакомитесь с историей\nсовременной филимоновской игрушки и слепите свистульку самостоятельно. И куда же без прогулок по заповеднику и областному центру. Скучно не будет!"},"4":{"Наименование маршрута ":"Тульский уикенд: редкие самовары, сладости и Лев Толстой","Место проведения":"Тульская область","Сезонность":"Круглогодично","Продолжительность":"2 дня","Описание маршрута ":"В Туле пьют чай из самовара, заваренный на шишках, пробуют белевскую пастилу. Испытав ее вкус, упаковками берут в подарок родным. А магия — в Музее-усадьбе А. Т. Болотова!\n\n В ней выпытывайте секретный рецепт долголетия. И вам его таки раскроют! Без сомнений, «вкус региона» не однотонный, не серый!"},"5":{"Наименование маршрута ":"Три дня в пряничном краю России: выходные в Тульской области","Место проведения":"Тульская область","Сезонность":"Круглогодично","Продолжительность":"1 день","Описание маршрута ":"Тула — один из старейших городов России. Сюда едут посмотреть Ясную Поляну, испечь своими руками тульский пряник и узнать, как еще на Руси использовали самовар."},"6":{"Наименование маршрута ":"По местам ратной славы Тульского края","Место проведения":"Тульская область","Сезонность":"Круглогодично","Продолжительность":"1 день","Описание маршрута ":"Еще в 1595 году государь Федор Иоаннович велел поселить за рекой Упой 30 кузнецов, «дабы делали государево самопальное дело». А в 1712 году Петр I дал отмашку на строительство заводов. Об этом напоминает памятник царю у проходных, который был создан на деньги рабочих завода.\n\nКстати, и памятник, и музей стоят на улице Мосина. Этот талантливый русский инженер создал превосходную для своего времени винтовку-трехлинейку, которую в солдатской среде называли «мосинка».\n\nКремль Тулы построен на важнейшем стратегическом направлении крымско-татарских набегов — Муравском шляхе. Несколько столетий он оборонял южные рубежи Русского государства, являлся главным звеном знаменитой Большой Засечной черты. Наш маршрут — военной выправки."}}